Catalogs/ВидыСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ВидыСертификатов</Name>
			<Comment>Виды сертификатов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OnLine</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаДисконтнаяКатрочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминалПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыСертификатов/Ext/ManagerModule.bsl
Функция НайтиСписокВидовСертификатов() Экспорт
	   
	   Запрос = Новый Запрос("ВЫБРАТЬ
	   |	ВидыСертификатов.Ссылка
	   |ИЗ
	   |	Справочник.ВидыСертификатов КАК ВидыСертификатов
	   |ГДЕ
	   |	(НЕ ВидыСертификатов.ПометкаУдаления)");
	   Результат = Запрос.Выполнить().Выгрузить();
	   Возврат Результат.ВыгрузитьКолонку("Ссылка");
	   
   КонецФункции  
   
   Процедура СоздатьЗаписьВСправочнике(CODE, NAME, REQUIREDDISCOUNT, REQUIREDPASSWORD, СтрАнализа) Экспорт 
	   
	   Ссылка = НайтиЭлементВСправочнике(CODE);
	   
	   Если не Ссылка.Пустая() Тогда
		   НовыйСправочник  = Ссылка.ПолучитьОбъект();              
	   Иначе 	  
		   НовыйСправочник  = Справочники.ВидыСертификатов.СоздатьЭлемент();
		   //НовыйСправочник.УстановитьНовыйКод();
		   СтрАнализа.Новых = СтрАнализа.Новых + 1;
	   КонецЕсли;
	   
	   НовыйСправочник.Код =  CODE;
	   НовыйСправочник.Наименование = NAME;
	   НовыйСправочник.НеобходимаДисконтнаяКатрочка = REQUIREDDISCOUNT;
	   НовыйСправочник.НеобходимПароль = REQUIREDPASSWORD;
	   
	   Попытка
		   НовыйСправочник.ОбменДанными.Загрузка = Истина;
		   НовыйСправочник.Записать();
	   Исключение
		   //Ошибка = ОписаниеОшибки();
	   КонецПопытки;                             
	   
   КонецПроцедуры
   
   Функция НайтиЭлементВСправочнике(CODE) Экспорт
	   Запрос = Новый Запрос;
	   Запрос.УстановитьПараметр("Код", CODE);	
	   Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	   |	ВидыСертификатов.Ссылка
	   |ИЗ
	   |	Справочник.ВидыСертификатов КАК ВидыСертификатов
	   |ГДЕ
	   |	ВидыСертификатов.Код = &Код";
	   
	   Результат = Запрос.Выполнить();
	   
	   Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	   
	   Если Выборка.Следующий() Тогда
		   Возврат Выборка.Ссылка;   
	   Иначе 
		   Возврат Справочники.ВидыСертификатов.ПустаяСсылка();	   
	   КонецЕсли;
	   
   КонецФункции
   
   
// Рефакторинг: 
//	1. Перенести в соответсвующую загрузку;
//	2. Переименовать "НеобходимаДисконтнаяКатрочка" в "НеобходимаДисконтнаяКарточка" (опечатка в слове "Карточка").
